eldarkg/emdr1986x-std-per-lib/MDR32F8_StdPeriph_Driver/src/mdr32f8_clkctrl.c
/**
  ******************************************************************************
  * @file    mdr32f8_clkctrl.c
  * @author  Milandr
  * @version V1.0.0
  * @date    20/07/2015
  * @brief   This file contains all the RST_CLK firmware functions.
  ******************************************************************************
  * <br><br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, PHYTON SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
  * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2015 Milandr</center></h2>
  ******************************************************************************
  * FILE mdr32f8_clkctrl.c
  */
	
	/* Includes ------------------------------------------------------------------*/
	#include "mdr32f8_clkctrl.h"
	#include "MDR1986VE8T.h"
	
	
	#define ASSERT_INFO_FILE_ID FILEID__MDR32F8_CLKCTRL
	
	/** @addtogroup MDR32F8_StdPeriph_Driver
  * @{
  */

/** @defgroup CLKCTRL
  * @brief CLKCTRL driver modules
  * @{
  */ 
	
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define CLKCTRL_OFFSET              (CLK_CNTR_BASE - PERIPH_BASE)
#define BKP_OFFSET                  (BKP_BASE - PERIPH_BASE)
#define SFR_OFFSET(TP, MOD, SFR)    ((uint32_t)&((TP*)MOD)->SFR)
#define BB_ADDR(TP, MOD, SFR, BIT)  (PERIPH_BB_BASE + SFR_OFFSET(TP, MOD, SFR)*32 + BIT*4)
#define CLKCTRL_BB(SFR, BIT)        BB_ADDR(CLKControl, CLKCTRL_OFFSET, SFR, BIT)
#define BKP_BB(SFR, BIT)            BB_ADDR(BKPControl, BKP_OFFSET, SFR, BIT)

#define CPUCLKdiv_msk								(~(uint32_t)0x00007FFF)

#define PLL_MULoffset								8
#define PLL_SELoffset								29
#define PLL_MULclr 									(~(uint32_t)0x00004100)
#define PLL_SELclr 									(~(uint32_t)0xE0000000)

#define FLAG_MASK                   ((uint8_t)0x1F)
#define FLAG_SFR_MASK               ((uint8_t)0xE0)

#define HSEonTimeOut               ((uint16_t)0x0600)
#define LSEonTimeOut               ((uint16_t)0x0600)
#define HSIonTimeOut               ((uint16_t)0x0600)
#define LSIonTimeOut               ((uint16_t)0x0600)
#define PLLCPUonTimeOut            ((uint16_t)0x0600)

#define HSITRIM_OFFSET              24
#define HSITRIM_MASK                ((uint32_t)(0x3F << HSITRIM_OFFSET))

#define HSION_OFFSET                22
#define HSION_MASK                  ((uint32_t)(1 << HSION_OFFSET))

#define LSITRIM_OFFSET              16
#define LSITRIM_MASK                ((uint32_t)(0x1F << LSITRIM_OFFSET))

#define LSION_OFFSET                15
#define LSION_MASK                  ((uint32_t)(1 << LSION_OFFSET))

#define BKPCNTR_REG_63_TMR0_HSION_BB      BKP_BB(REG_63_TMR0, HSION_OFFSET)
#define BKPCNTR_REG_63_TMR1_HSION_BB      BKP_BB(REG_63_TMR1, HSION_OFFSET)
#define BKPCNTR_REG_63_TMR2_HSION_BB      BKP_BB(REG_63_TMR2, HSION_OFFSET)
	
#define BKPCNTR_REG_63_TMR0_LSION_BB      BKP_BB(REG_63_TMR0, LSION_OFFSET)
#define BKPCNTR_REG_63_TMR1_LSION_BB      BKP_BB(REG_63_TMR1, LSION_OFFSET)
#define BKPCNTR_REG_63_TMR2_LSION_BB      BKP_BB(REG_63_TMR2, LSION_OFFSET)
	
#define PLL0CPUON_BB                 CLKCTRL_BB(PLL0_CLK, 27)
#define PLL0CPURLD_BB                CLKCTRL_BB(PLL0_CLK, 28)
#define PLL1CPUON_BB                 CLKCTRL_BB(PLL1_CLK, 27)
#define PLL1CPURLD_BB                CLKCTRL_BB(PLL1_CLK, 28)
#define PLL2CPUON_BB                 CLKCTRL_BB(PLL2_CLK, 27)
#define PLL2CPURLD_BB                CLKCTRL_BB(PLL2_CLK, 28)
#define PLL3CPUON_BB                 CLKCTRL_BB(PLL3_CLK, 27)
#define PLL3CPURLD_BB                CLKCTRL_BB(PLL3_CLK, 28)
#define PLL4CPUON_BB                 CLKCTRL_BB(PLL4_CLK, 27)
#define PLL4CPURLD_BB                CLKCTRL_BB(PLL4_CLK, 28)
#define PLL5CPUON_BB                 CLKCTRL_BB(PLL5_CLK, 27)
#define PLL5CPURLD_BB                CLKCTRL_BB(PLL5_CLK, 28)
#define PLL6CPUON_BB                 CLKCTRL_BB(PLL6_CLK, 27)
#define PLL6CPURLD_BB                CLKCTRL_BB(PLL6_CLK, 28)
#define PLL7CPUON_BB                 CLKCTRL_BB(PLL7_CLK, 27)
#define PLL7CPURLD_BB                CLKCTRL_BB(PLL7_CLK, 28)
	
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/** @defgroup RCC_Private_Functions
  * @{
  */ 

/**
  * @brief  Set the CLKCTRL clock configuration to the default reset state.
  * @param  None
  * @retval None
  */
void CLKCTRL_DeInit(void)
{
  /* Prepare HSI clk */
  BKP->REG_63_TMR0 |= (1<<22);
  BKP->REG_63_TMR1 |= (1<<22);
  BKP->REG_63_TMR2 |= (1<<22);

  /* Reset MAX_CLK bits, MAX_CLK = HSI */
  CLK_CNTR->MAX_CLK = 0x00000000;

  /* Reset PLLn_CONTROL bits */
  CLK_CNTR->PLL0_CLK = 0x00000000;
	CLK_CNTR->PLL1_CLK = 0x00000000;
	CLK_CNTR->PLL2_CLK = 0x00000000;
	CLK_CNTR->PLL3_CLK = 0x00000000;
	CLK_CNTR->PLL4_CLK = 0x00000000;
	CLK_CNTR->PLL5_CLK = 0x00000000;
	CLK_CNTR->PLL6_CLK = 0x00000000;
	CLK_CNTR->PLL7_CLK = 0x00000000;
	
  /* Reset HSEn_CONTROL bits */	
	CLK_CNTR->HSE0_CLK = 0x00000000;
	CLK_CNTR->HSE1_CLK = 0x00000000;
	
  /* Reset PERn_CLK bits except CLKCTRL and BKPCTRL bits */	
	CLK_CNTR->PER0_CLK = 0x00000003;
	CLK_CNTR->PER1_CLK = 0x00000000;
}



/**
  * @brief  BKPCNTR_REG_63_TMRx_HSIcmd:  HSI (High Speed Internal) clock mode selection
  * @param  NewState: mode selector - DISABLE, ENABLE
  *         @arg DISABLE:   switch off HSI clock generator
  *         @arg ENABLE:    switch on HSI clock generator
  * @retval None
  */
void BKPCNTR_REG_63_TMRx_HSIcmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  *(__IO uint32_t *) BKPCNTR_REG_63_TMR0_HSION_BB = (uint32_t)NewState;
  *(__IO uint32_t *) BKPCNTR_REG_63_TMR1_HSION_BB = (uint32_t)NewState;
  *(__IO uint32_t *) BKPCNTR_REG_63_TMR2_HSION_BB = (uint32_t)NewState;
}

/**
  * @brief  BKPCTRL_HSIstatus: HSI clock status
  * @param  None
  * @retval enum ErrorStatus: SUCCESS if HSI clock is ready, else ERROR
  */
ErrorStatus BKPCNTR_REG_63_TMRx_HSIstatus(void)
{
  __IO uint32_t startCounter = 0;
  ErrorStatus state;
  FlagStatus flag0;
	FlagStatus flag1;
	FlagStatus flag2;

  /* Wait until HSI is ready or time out is occure */
  do
  {
    flag0 = CLKCTRL_BKPCTRL_GetFlagStatus(BKPCTRL_REG_63_TMR0_HSI_RDY);
		flag1 = CLKCTRL_BKPCTRL_GetFlagStatus(BKPCTRL_REG_63_TMR1_HSI_RDY);
		flag2 = CLKCTRL_BKPCTRL_GetFlagStatus(BKPCTRL_REG_63_TMR2_HSI_RDY);
    startCounter++;
  } while ((startCounter < HSIonTimeOut) && (flag0 == RESET) && (flag1 == RESET) && (flag2 == RESET));

  if (CLKCTRL_BKPCTRL_GetFlagStatus(BKPCTRL_REG_63_TMR0_HSI_RDY) != RESET && 
		CLKCTRL_BKPCTRL_GetFlagStatus(BKPCTRL_REG_63_TMR1_HSI_RDY) != RESET && 
	CLKCTRL_BKPCTRL_GetFlagStatus(BKPCTRL_REG_63_TMR2_HSI_RDY) != RESET)
  {
    state = SUCCESS;
  }
  else
  {
    state = ERROR;
  }
  return state;
}

/**
  * @brief  BKPCTRL_HSIadjust: HSI clock frequency adjustment by HSITRIM setting
  * @param  HSItrimValue
  *         This parameter must be a number between 0 and 0x3F.
  * @retval None
  */
void BKPCNTR_REG_63_TMRx_HSIadjust(uint32_t HSItrimValue)
{
  uint32_t temp;
  /* Check the parameters */
  assert_param(IS_BKPCTRL_REG_63_HSI_TRIM_VALUE(HSItrimValue));
  temp = BKP->REG_63_TMR0;
  /* Clear HSITRIM[5:0] bits */
  temp &= ~HSITRIM_MASK;
  /* Set the HSITRIM[5:0] bits according to HSItrimValue value */
  temp |= (uint32_t)HSItrimValue << HSITRIM_OFFSET;
  /* Store the new value */
  BKP->REG_63_TMR0 = temp;
	BKP->REG_63_TMR1 = temp;
	BKP->REG_63_TMR2 = temp;
}

/**
  * @brief  Checks whether the specified CLKCTRL_BKPCTRL flag is set or not.
  * @param  CLKCTRL_BKPCTRL_FLAG: specifies the flag to check.
  *         This parameter can be one of the following values:
  *         @arg BKPCTRL_REG_63_TMRx_LSE_RDY
  *              BKPCTRL_REG_63_TMRx_LSI_RDY
  *              BKPCTRL_REG_63_TMRx_HSI_RDY
  *							 CLKCTRL_HSEn_STAT_HSEn_RDY
  *							 CLKCTRL_PLLn_STAT_PLLn_RDY
  * @retval The new state of CLKCTRL_BKPCTRL_FLAG (SET or RESET).
  */
FlagStatus CLKCTRL_BKPCTRL_GetFlagStatus(uint32_t CLKCTRL_BKPCTRL_FLAG)
{
	uint32_t tmp = 0;
	uint32_t tmp_E = 0;
	uint32_t tmp_P = 0;
	uint32_t tmp_I = 0;
	
  uint32_t statusreg;
  FlagStatus bitstatus = RESET;

  /* Check the parameters */
  assert_param(IS_CLKCTRL_BKPCTRL_FLAG(CLKCTRL_BKPCTRL_FLAG));

