eldarkg/emdr1986x-std-per-lib/MDR32F8_StdPeriph_Driver/src/mdr32f8_clkctrl.c
	tmp_E = (CLKCTRL_BKPCTRL_FLAG>>5)&0x03;
	tmp_P = (CLKCTRL_BKPCTRL_FLAG>>7)&0x0F;
	tmp_I = CLKCTRL_BKPCTRL_FLAG>>11;
	
  /* Get the register */
	//--------------tmp_E-----------------
  if (tmp_E==2)                                                  
  {
    statusreg = CLK_CNTR->HSE0_STAT;
  }
		else if (tmp_E==3)                                                   
		{
		statusreg = CLK_CNTR->HSE1_STAT;
		}
	//--------------tmp_P-----------------
			else if (tmp_P==1)                                                   
			{
				statusreg = CLK_CNTR->PLL0_STAT;
			}
				else if (tmp_P==2)                                                   
				{
					statusreg = CLK_CNTR->PLL1_STAT;
				}
					else if (tmp_P==3)                                                   
					{
						statusreg = CLK_CNTR->PLL2_STAT;
					}
						else if (tmp_P==4)                                                   
						{
							statusreg = CLK_CNTR->PLL3_STAT;
						}
					else if (tmp_P==5)                                                   
					{
						statusreg = CLK_CNTR->PLL4_STAT;
					}
				else if (tmp_P==6) 
				{
					statusreg = CLK_CNTR->PLL5_STAT;
				}
			else if (tmp_P==7) 
			{
				statusreg = CLK_CNTR->PLL6_STAT;
			}
		else if (tmp_P==8) 
		{
			statusreg = CLK_CNTR->PLL7_STAT;
		}
	//--------------tmp_I-----------------
	else if (tmp_I==1) 
	{
	statusreg = BKP->REG_63_TMR0;
	}			
		else if (tmp_I==2) 
		{
		statusreg = BKP->REG_63_TMR1;
		}		
			else if (tmp_I==3) 
			{
			statusreg = BKP->REG_63_TMR2;
			}		
  /* Get the flag status on proper position */
	tmp = CLKCTRL_BKPCTRL_FLAG & FLAG_MASK;	
  if ((statusreg & ((uint32_t)1 << tmp)) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  /* Return the flag status */
  return bitstatus;
}

/**
  * @brief  CLKCTRL_MAX_CLKSelection: select the CPU clock source.
  * @param  MAX_CLK: specifies the CPU clock source.
  *         @arg CLKCTRL_MAX_CLK_HSIdiv1
  *         @arg CLKCTRL_MAX_CLK_HSIdiv2
  *         @arg CLKCTRL_MAX_CLK_HSE0div1
  *         @arg CLKCTRL_MAX_CLK_HSE0div2
  *         @arg CLKCTRL_MAX_CLK_HSE1div1
  *         @arg CLKCTRL_MAX_CLK_HSE1div2
  *         @arg CLKCTRL_MAX_CLK_LSI
  *         @arg CLKCTRL_MAX_CLK_LSE
  *         @arg CLKCTRL_MAX_CLK_PLLn
  * @retval None
  */
void CLKCTRL_MAX_CLKSelection(uint32_t MAX_CLK)
{
  /* Check the parameters */
  assert_param(IS_CLKCTRL_MAX_CLK(MAX_CLK));
  /* Store the new value */
  CLK_CNTR->MAX_CLK = MAX_CLK;
}

/**
  * @brief  CLKCTRL_CPUclkPrescaler: configures the CPU_C3_SEL division factor switch.
  * @param  CPUclkDivValue: specifies the CPU_PLL clock division factor.
  *         @arg RST_CLK_CPUclkDIV1
  *         @arg RST_CLK_CPUclkDIV2
  *         @arg RST_CLK_CPUclkDIV4
  *         @arg RST_CLK_CPUclkDIV8
  *         @arg RST_CLK_CPUclkDIV16
  *         @arg RST_CLK_CPUclkDIV32
  *         @arg RST_CLK_CPUclkDIV64
  *         @arg RST_CLK_CPUclkDIV128
  *         @arg RST_CLK_CPUclkDIV256
  * @retval None
  */
void CLKCTRL_CPUclkPrescaler(uint32_t CPUclkDivValue)
{
  uint32_t temp;

  /* Check the parameters */
  assert_param(IS_CLKCTRL_CPU_CLK_CPUclkDIV(CPUclkDivValue));

  temp = CLK_CNTR->CPU_CLK;
  /* Clear CPU_C3_SEL bits */
  temp &= CPUCLKdiv_msk;
  /* Set the CPU_C3_SEL bits */
  temp |= CPUclkDivValue;
  /* Store the new value */
  CLK_CNTR->CPU_CLK = temp;
}

/**
  * @brief	CLKCTRL_PER0_CLKcmd: enables or disables clock of peripherals.
  * @param  CLKCTRL_PER0_CLK: specifies the peripheral to gates its clock.
  *         This parameter can be any combination of the following values:
  *           @arg CLKCTRL_PER0_CLK
  * @param  NewState: new state of the specified peripheral clock.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void CLKCTRL_PER0_CLKcmd(uint32_t CLKCTRL_PER0_CLK, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
	assert_param(IS_CLKCTRL_PER0_CLK(CLKCTRL_PER0_CLK));
	
  if (NewState != DISABLE)
  {
    CLK_CNTR->PER0_CLK |= CLKCTRL_PER0_CLK;
  }
  else
  {
    CLK_CNTR->PER0_CLK &= ~CLKCTRL_PER0_CLK;
  }
}

/**
  * @brief	CLKCTRL_PER1_CLKcmd: enables or disables clock of peripherals.
  * @param  CLKCTRL_PER1_CLK: specifies the peripheral to gates its clock.
  *         This parameter can be any combination of the following values:
  *           @arg CLKCTRL_PER1_CLK
  * @param  NewState: new state of the specified peripheral clock.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void CLKCTRL_PER1_CLKcmd(uint32_t CLKCTRL_PER1_CLK, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
	assert_param(IS_CLKCTRL_PER1_CLK(CLKCTRL_PER1_CLK));
	
  if (NewState != DISABLE)
  {
    CLK_CNTR->PER1_CLK |= CLKCTRL_PER1_CLK;
  }
  else
  {
    CLK_CNTR->PER1_CLK &= ~CLKCTRL_PER1_CLK;
  }
}

/**
  * @brief  CLKCTRL_HSEconfig - HSE (High Speed External) clock mode and source selection
  * @param  CLKCTRL_HSE - mode selector
  *         @arg CLKCTRL_HSE_OFF    -  switch off HSE clock generator
  *         @arg CLKCTRL_HSE_ON     -  switch on HSE clock generator
  *         @arg CLKCTRL_HSE_Bypass -  use external clock source
  * @retval None
  */
void CLKCTRL_HSEconfig(uint32_t CLKCTRL_HSE)
{
  /* Check the parameters */
  assert_param(IS_CLKCTRL_HSEn_CLK(CLKCTRL_HSE));
  /* Reset HSEON and HSEBYP bits before configuring the HSE */
  CLK_CNTR->HSE0_CLK &= ~((uint32_t)(CLKCTRL_HSE0_CLK_ON | CLKCTRL_HSE0_CLK_BYP));
	CLK_CNTR->HSE1_CLK &= ~((uint32_t)(CLKCTRL_HSE1_CLK_ON | CLKCTRL_HSE1_CLK_BYP));
  /* Configure HSE */
  switch (CLKCTRL_HSE)
  {
    case CLKCTRL_HSE0_CLK_ON:
      /* Set HSEON bit */
      CLK_CNTR->HSE0_CLK |= CLKCTRL_HSE0_CLK_ON;
      break;

    case CLKCTRL_HSE0_CLK_BYP:
      /* Set HSEBYP and HSEON bits */
      CLK_CNTR->HSE0_CLK |= CLKCTRL_HSE0_CLK_ON | CLKCTRL_HSE0_CLK_BYP;
      break;
		
		case CLKCTRL_HSE1_CLK_ON:
      /* Set HSEON bit */
      CLK_CNTR->HSE1_CLK |= CLKCTRL_HSE0_CLK_ON;
      break;

