eldarkg/emdr1986x-std-per-lib/MDR32F8_StdPeriph_Driver/src/mdr32f8_clkctrl.c
    case CLKCTRL_HSE1_CLK_BYP:
      /* Set HSEBYP and HSEON bits */
      CLK_CNTR->HSE1_CLK |= CLKCTRL_HSE0_CLK_ON | CLKCTRL_HSE0_CLK_BYP;
      break;

    default:
      break;
  }
}

/**
  * @brief  CLKCTRL_HSEstatus - HSE clock status
  * @param  None
  * @retval enum ErrorStatus - SUCCESS if HSE clock is ready, else ERROR
  */
ErrorStatus CLKCTRL_HSEstatus(uint32_t CLKCTRL_HSE)
{
  __IO uint32_t startCounter = 0;
  ErrorStatus state;
  FlagStatus flag;


	if(CLKCTRL_HSE==CLKCTRL_HSEn_STAT_HSE0_RDY){
  /* Wait until HSE is ready or time out is occure */
		do
		{
			flag = CLKCTRL_BKPCTRL_GetFlagStatus(CLKCTRL_HSEn_STAT_HSE0_RDY);
			startCounter++;
		} while ((startCounter < HSEonTimeOut) && (flag == RESET));

		if (CLKCTRL_BKPCTRL_GetFlagStatus(CLKCTRL_HSEn_STAT_HSE0_RDY) != RESET)
		{
			state = SUCCESS;
		}
		else
		{
			state = ERROR;
		}
	}
		else if(CLKCTRL_HSE==CLKCTRL_HSEn_STAT_HSE1_RDY){
		/* Wait until HSE is ready or time out is occure */
			do
			{
				flag = CLKCTRL_BKPCTRL_GetFlagStatus(CLKCTRL_HSEn_STAT_HSE1_RDY);
				startCounter++;
			} while ((startCounter < HSEonTimeOut) && (flag == RESET));

			if (CLKCTRL_BKPCTRL_GetFlagStatus(CLKCTRL_HSEn_STAT_HSE1_RDY) != RESET)
			{
				state = SUCCESS;
			}
			else
			{
				state = ERROR;
			}
		}
  return state;
}

/**
  * @brief  BKPCTRL_REG_63_LSEconfig - LSE (Low Speed External) clock mode and source selection
  * @param  CLKCTRL_BKPCTRL_LSE - mode selector
  *         @arg CLKCTRL_BKPCTRL_LSE_OFF    -  switch off LSE clock generator
  *         @arg CLKCTRL_BKPCTRL_LSE_ON     -  switch on LSE clock generator
  *         @arg CLKCTRL_BKPCTRL_LSE_Bypass -  use external clock source
  * @retval None
  */
void BKPCTRL_REG_63_LSEconfig(uint32_t CLKCTRL_BKPCTRL_LSE)
{
  /* Check the parameters */
  assert_param(IS_BKPCTRL_REG_63_TMR0_LSE(CLKCTRL_BKPCTRK_LSE));
  /* Reset LSEON and LSEBYP bits before configuring the LSE */
  BKP->REG_63_TMR0 &= ~((uint32_t)(BKPCTRL_REG_63_TMR0_LSE_ON | BKPCTRL_REG_63_TMR0_LSE_BYP));
	BKP->REG_63_TMR1 &= ~((uint32_t)(BKPCTRL_REG_63_TMR1_LSE_ON | BKPCTRL_REG_63_TMR1_LSE_BYP));
	BKP->REG_63_TMR2 &= ~((uint32_t)(BKPCTRL_REG_63_TMR2_LSE_ON | BKPCTRL_REG_63_TMR2_LSE_BYP));
  switch (CLKCTRL_BKPCTRL_LSE)
  {
    case BKPCTRL_REG_63_TMR0_LSE_ON:
      /* Set LSEON bit */
      BKP->REG_63_TMR0 |= BKPCTRL_REG_63_TMR0_LSE_ON;
		  BKP->REG_63_TMR1 |= BKPCTRL_REG_63_TMR1_LSE_ON;
		  BKP->REG_63_TMR2 |= BKPCTRL_REG_63_TMR2_LSE_ON;
      break;

    case BKPCTRL_REG_63_TMR0_LSE_BYP:
      /* Set LSEBYP and LSEON bits */
      BKP->REG_63_TMR0 |= (BKPCTRL_REG_63_TMR0_LSE_ON | BKPCTRL_REG_63_TMR0_LSE_BYP);
		  BKP->REG_63_TMR1 |= (BKPCTRL_REG_63_TMR1_LSE_ON | BKPCTRL_REG_63_TMR1_LSE_BYP);
		  BKP->REG_63_TMR2 |= (BKPCTRL_REG_63_TMR2_LSE_ON | BKPCTRL_REG_63_TMR2_LSE_BYP);
      break;

    default:
      break;
  }
}

/**
  * @brief  BKPCTRL_REG_63_LSEstatus - LSE clock status
  * @param  None
  * @retval enum ErrorStatus - SUCCESS if LSE clock is ready, else ERROR
  */
ErrorStatus BKPCTRL_REG_63_LSEstatus(void)
{
  __IO uint32_t startCounter = 0;
  ErrorStatus state;
  FlagStatus flag0;
	FlagStatus flag1;
	FlagStatus flag2;

 /* Wait until LSE is ready or time out is occure */
 do
  {
    flag0 = CLKCTRL_BKPCTRL_GetFlagStatus(BKPCTRL_REG_63_TMR0_LSE_RDY);
		flag1 = CLKCTRL_BKPCTRL_GetFlagStatus(BKPCTRL_REG_63_TMR1_LSE_RDY);
		flag2 = CLKCTRL_BKPCTRL_GetFlagStatus(BKPCTRL_REG_63_TMR2_LSE_RDY);
    startCounter++;
  } while ((startCounter < LSEonTimeOut) && (flag0 == RESET) && (flag1 == RESET) && (flag2 == RESET));

  if (CLKCTRL_BKPCTRL_GetFlagStatus(BKPCTRL_REG_63_TMR0_LSE_RDY) != RESET && 
		CLKCTRL_BKPCTRL_GetFlagStatus(BKPCTRL_REG_63_TMR1_LSE_RDY) != RESET && 
	CLKCTRL_BKPCTRL_GetFlagStatus(BKPCTRL_REG_63_TMR2_LSE_RDY) != RESET)
  {
    state = SUCCESS;
  }
  else
  {
    state = ERROR;
  }
  return state;
}

/**
  * @brief  BKPCNTR_REG_63_LSIcmd:  LSI (High Speed Internal) clock mode selection
  * @param  NewState: mode selector - DISABLE, ENABLE
  *         @arg DISABLE:   switch off LSI clock generator
  *         @arg ENABLE:    switch on LSI clock generator
  * @retval None
  */
void BKPCNTR_REG_63_TMRx_LSIcmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  *(__IO uint32_t *) BKPCNTR_REG_63_TMR0_LSION_BB = (uint32_t) NewState;
	*(__IO uint32_t *) BKPCNTR_REG_63_TMR1_LSION_BB = (uint32_t) NewState;
	*(__IO uint32_t *) BKPCNTR_REG_63_TMR2_LSION_BB = (uint32_t) NewState;
}

/**
  * @brief  BKPCTRL_REG_63_HSIadjust: LSI clock frequency adjustment by LSITRIM setting
  * @param  LSItrimValue
  *         This parameter must be a number between 0 and 0x1F.
  * @retval None
  */
void BKPCTRL_REG_63_LSIadjust(uint32_t LSItrimValue)
{
  uint32_t temp;
  /* Check the parameters */
  assert_param(IS_BKPCTRL_REG_63_LSI_TRIM_VALUE(LSItrimValue));
  temp = BKP->REG_63_TMR0;
  /* Clear LSITRIM[4:0] bits */
  temp &= ~LSITRIM_MASK;
  /* Set the LSITRIM[4:0] bits according to LSItrimValue value */
  temp |= (uint32_t)LSItrimValue << LSITRIM_OFFSET;
  /* Store the new value */
  BKP->REG_63_TMR0 = temp;
	BKP->REG_63_TMR1 = temp;
	BKP->REG_63_TMR2 = temp;
}

/**
  * @brief  BKPCTRL_REG_63_LSIstatus - LSI clock status
  * @param  None
  * @retval enum ErrorStatus - SUCCESS if LSI clock is ready, else ERROR
  */
ErrorStatus BKPCTRL_REG_63_LSIstatus(void)
{
  __IO uint32_t startCounter = 0;
  ErrorStatus state;
  FlagStatus flag0;
	FlagStatus flag1;
	FlagStatus flag2;

  /* Wait until LSI is ready or time out is occure */
  do
  {
    flag0 = CLKCTRL_BKPCTRL_GetFlagStatus(BKPCTRL_REG_63_TMR0_LSI_RDY);
		flag1 = CLKCTRL_BKPCTRL_GetFlagStatus(BKPCTRL_REG_63_TMR1_LSI_RDY);
		flag2 = CLKCTRL_BKPCTRL_GetFlagStatus(BKPCTRL_REG_63_TMR2_LSI_RDY);
    startCounter++;
  } while ((startCounter < LSIonTimeOut) && (flag0 == RESET) && (flag1 == RESET) && (flag2 == RESET));

  if (CLKCTRL_BKPCTRL_GetFlagStatus(BKPCTRL_REG_63_TMR0_LSI_RDY) != RESET && 
		CLKCTRL_BKPCTRL_GetFlagStatus(BKPCTRL_REG_63_TMR1_LSI_RDY) != RESET && 
	CLKCTRL_BKPCTRL_GetFlagStatus(BKPCTRL_REG_63_TMR2_LSI_RDY) != RESET)
  {
    state = SUCCESS;
  }
  else
  {
    state = ERROR;
  }
  return (state);
}

/**
  * @brief  Configures the CPU_PLL clock source and multiplication factor.
  * @param  RST_CLK_CPU_PLLsource: specifies the PLL entry clock source.
  *         @arg RST_CLK_CPU_PLLsrcHSIdiv1: HSI oscillator clock is selected as CPU_PLL clock entry
  *         @arg RST_CLK_CPU_PLLsrcHSIdiv2: HSI oscillator clock divided by 2 is selected as CPU_PLL clock entry
  *         @arg RST_CLK_CPU_PLLsrcHSEdiv1: HSE oscillator clock is selected as CPU_PLL clock entry
  *         @arg RST_CLK_CPU_PLLsrcHSEdiv2: HSE oscillator clock divided by 2 is selected as CPU_PLL clock entry
  * @param  RST_CLK_CPU_PLLmul: specifies the PLL multiplication factor.
  *         This parameter must be a number between 1 and 16.
  *           @arg RST_CLK_CPU_PLLmul1
  *           @arg RST_CLK_CPU_PLLmul2
  *           @arg RST_CLK_CPU_PLLmul3
  *           @arg RST_CLK_CPU_PLLmul4
  *           @arg RST_CLK_CPU_PLLmul5
  *           @arg RST_CLK_CPU_PLLmul6
  *           @arg RST_CLK_CPU_PLLmul7
  *           @arg RST_CLK_CPU_PLLmul8
  *           @arg RST_CLK_CPU_PLLmul9
  *           @arg RST_CLK_CPU_PLLmul10
  *           @arg RST_CLK_CPU_PLLmul11
  *           @arg RST_CLK_CPU_PLLmul12
  *           @arg RST_CLK_CPU_PLLmul13
  *           @arg RST_CLK_CPU_PLLmul14
  *           @arg RST_CLK_CPU_PLLmul15
  *           @arg RST_CLK_CPU_PLLmul16
  * @retval None
  */
void CLKCTRL_CPU_PLLconfig (uint32_t PLLn, uint32_t CLKCTRL_CPU_PLLsource,
	uint32_t CLKCTRL_PLLn_CLK_PLLn_Q, uint32_t CLKCTRL_PLLn_CLK_PLLn_N )
{
  uint32_t temp;
	//uint32_t reg;
	uint32_t PLLON_def;
	uint32_t PLLPLD_def;
  /* Check the parameters */
  assert_param(IS_CLKCTRL_PLLn_CLK_SELECT(CLKCTRL_CPU_PLLsource));
	assert_param(IS_CLKCTRL_PLLn_CLK_PLLn_N(CLKCTRL_PLLn_CLK_PLLn_N));

	switch (PLLn)
  {
    case PLL0:
		temp = CLK_CNTR->PLL0_CLK;
		temp &= PLL_SELclr;
		temp |= (CLKCTRL_CPU_PLLsource<<PLL_SELoffset) | (CLKCTRL_PLLn_CLK_PLLn_Q) | (CLKCTRL_PLLn_CLK_PLLn_N<<PLL_MULoffset);
		CLK_CNTR->PLL0_CLK=temp;
		
		PLLON_def = PLL0CPUON_BB;
		PLLPLD_def = PLL0CPURLD_BB;
      break;
		case 1:
//		reg = CLK_CNTR->PLL1_CLK;
		PLLON_def = PLL1CPUON_BB;
		PLLPLD_def = PLL1CPUON_BB;
      break;
    case 2:
//		reg = CLK_CNTR->PLL2_CLK;
		PLLON_def = PLL2CPUON_BB;
		PLLPLD_def = PLL2CPUON_BB;
      break;
    case 3:
//		reg = CLK_CNTR->PLL3_CLK;
		PLLON_def = PLL3CPUON_BB;
		PLLPLD_def = PLL3CPUON_BB;
      break;
    case 4:
//		reg = CLK_CNTR->PLL4_CLK;
		PLLON_def = PLL4CPUON_BB;
		PLLPLD_def = PLL4CPUON_BB;
      break;
    case 5:
//		reg = CLK_CNTR->PLL5_CLK;
		PLLON_def = PLL5CPUON_BB;
		PLLPLD_def = PLL5CPUON_BB;
      break;
    case 6:
//		reg = CLK_CNTR->PLL6_CLK;
		PLLON_def = PLL6CPUON_BB;
		PLLPLD_def = PLL6CPUON_BB;
      break;
    case 7:
//		reg = CLK_CNTR->PLL7_CLK;
		PLLON_def = PLL7CPUON_BB;
		PLLPLD_def = PLL7CPUON_BB;
      break;		
    default:
      break;
  }	
	
	*(__IO uint32_t *) PLLON_def = (uint32_t) 0x01;
	
	*(__IO uint32_t *) PLLPLD_def = (uint32_t) 0x01;
  *(__IO uint32_t *) PLLPLD_def = (uint32_t) 0x00;
	
}

/**
  * @brief  Enables or disables the CPU_PLL.
  * @param  NewState: new state of the CPU_PLL. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void CLKCTRL_CPU_PLLcmd ( FunctionalState NewState )
{
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  *(__IO uint32_t *) PLL0CPUON_BB = (uint32_t) NewState;
}

/**
  * @brief  CLKCTRL_CPU_PLLstatus: CPU_PLL status
  * @param  None
  * @retval enum ErrorStatus: SUCCESS if CPU_PLL output clock is ready, else ERROR
  */
ErrorStatus CLKCTRL_CPU_PLLstatus(uint32_t PLLn)
{
  __IO uint32_t startCounter = 0;
  ErrorStatus state;
  FlagStatus flag;
	uint32_t fl;
	
		switch (PLLn)
  {
    case 0:
			fl = CLKCTRL_PLLn_STAT_PLL0_RDY;
      break;
		case 1:
			fl = CLKCTRL_PLLn_STAT_PLL1_RDY;
      break;
    case 2:
			fl = CLKCTRL_PLLn_STAT_PLL2_RDY;
      break;
    case 3:
			fl = CLKCTRL_PLLn_STAT_PLL3_RDY;
      break;
    case 4:
			fl = CLKCTRL_PLLn_STAT_PLL4_RDY;
      break;
    case 5:
			fl = CLKCTRL_PLLn_STAT_PLL5_RDY;
      break;
    case 6:
			fl = CLKCTRL_PLLn_STAT_PLL6_RDY;
      break;
    case 7:
			fl = CLKCTRL_PLLn_STAT_PLL7_RDY;
      break;		
    default:
      break;
  }
  /* Wait until CPUPLL is ready or time out is occure */
  do
  {
    flag = CLKCTRL_BKPCTRL_GetFlagStatus(fl);
    startCounter++;
  } while ((startCounter < PLLCPUonTimeOut) && (flag == RESET));

  if (CLKCTRL_BKPCTRL_GetFlagStatus(fl) != RESET)
  {
    state = SUCCESS;
  }
  else
  {
    state = ERROR;
  }
  return state;
}

